"""
    在编程领域中，编程可以分成两大类：
        1.模块化编程 2.面向对象编程
    函数：
        就是一个被命名的、独立的、完成特定功能的代码段(一段连续的代码)，并可能给调用它的程序一个返回值

    函数目的：使代码可以重复使用
    函数作用：
        1.代码重用(代码重复使用)
        2.模块化编程(模块化编程的核心就是函数，一般是把一个系统分解为若干个功能，每个功能就是一个函数)

    函数：解决特定问题的方法

    格式：
        def 函数名():
            代码片段
            return      【有返回值函数】

    函数名注意事项：
        1.见名知意
        2.与变量名定义要求一致


    函数的调用：
        函数名()




"""

# sayHello
def sayHello():
    print("Hello")

sayHello()





# 加参数：需要动态调整函数结果的时候加参数，需要利用函数结果的时候返回结果 （自总结）
