"""
    元组：
        可以存储多个数据(支持不同类型)
        且元组内的数据是不能修改的       ## 不允许被修改的场景  例如：身份证号
    特点：
        使用小括号定义，且使用逗号隔开各个数据，数据可以是不同的数据类型。

    定义语法：
        元组姓名 = (元素1，元素2，元素3，....)       # 括号、逗号是英语的，
    注意： 在元组中，就算定义单个元组时，在单个元组后面也要加一个逗号。否则不会被定义成元组。

"""

tuple1 = (1,)
print(tuple1)

# 元组的访问  ：
#   格式：元组名[索引值]
#  ctrl+a  全选     ctrl+alt+L 格式化代码

tuple2 = (1223, "张三")
list1 = ["张三", 122, tuple2]

tuple3 = (11, "str", 1.4, True, list1)

print(tuple3[4][2][1])

tuple3=(["张三","lisi","王五"],[["张三","lisi","王五"],"lisi","王五"],["张三",["张三","lisi",[["张三","lisi","a","王五"],"lisi","王五"]],["张三","lisi","王五"],["张三","lisi","王五"],"王五"],["张三","lisi","王五"])

print(tuple3[2][1][2][0][2])